In [1]:
import numpy as np
import pandas as pd

In [5]:
employee = pd.DataFrame({
    'id':[1,2,3,4,5],
    'name':['john','anna','peter','linda','bob'],
    'department':['hr','it','finance','it','hr']
    
    
})

salaries = pd.DataFrame({
    'id':[1,2,3,6,7],
    'salary':[60000,80000,65000,70000,90000],
    'bonus':[5000,1000,7000,8000,1200]
    
})

In [6]:
pd.merge(employee,salaries)

   id   name department  salary  bonus
0   1   john         hr   60000   5000
1   2   anna         it   80000   1000
2   3  peter    finance   65000   7000